In [1]:
import numpy as np
import pandas as pd
pd.set_option('float_format', '{:.2f}'.format)

# line 3 limits floats to two decimal points (comment it out if neccessary / desired)
# alternvative # pd.options.display.float_format = "{:,.2f}".format

In [2]:
np.nan
# not a number

nan

In [3]:
pd.NA

In [4]:
pd.NaT
# not a timestap

NaT

In [5]:
myvar = np.nan
myvar == np.nan
# there is no way to tell if two missing values are identical

False

In [6]:
myvar is np.nan
# checks if variable is a missing value

True

In [7]:
df = pd.read_csv('./course-data/movie_scores.csv')
df
# the second row is missing all values
# Hugh Jackman has no scores

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00    m             8.00             10.00
1        NaN       NaN   nan  NaN              nan               nan
2       Hugh   Jackman 51.00    m              nan               nan
3      Oprah   Winfrey 66.00    f             6.00              8.00
4       Emma     Stone 31.00    f             7.00              9.00

In [8]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [9]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [10]:
df['pre_movie_score'].notnull()

0     True
1    False
2    False
3     True
4     True
Name: pre_movie_score, dtype: bool

In [11]:
df[df['pre_movie_score'].notnull()]
# we can do conditional filtering 
# we get back only the rows that do have a pre-movie score
# we can use the notnull() method for conditional fultering to select columns where
# certain features are present

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [12]:
df[df['pre_movie_score'].isnull() & df['first_name'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman 51.00   m              nan               nan

In [13]:
# KEEP DATA - check

# DROP DATA 
# call help(df.dropna) to be view detailed explanation!

# FILL DATA

In [14]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [15]:
df.dropna(thresh=4)
# drop all the rows that have NA unless they have at least N non-NA value (here N=4)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
2       Hugh   Jackman 51.00   m              nan               nan
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [16]:
df.dropna(thresh=5)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [17]:
df.dropna(axis=1)
# because of the all-NA row, all the columns -but the index- are dropped

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [18]:
df.dropna(subset=['last_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00   m             8.00             10.00
2       Hugh   Jackman 51.00   m              nan               nan
3      Oprah   Winfrey 66.00   f             6.00              8.00
4       Emma     Stone 31.00   f             7.00              9.00

In [19]:
# KEEP DATA - check

# DROP DATA - check

# FILL DATA
# call help(df.fillna) to be view detailed explanation!

In [28]:
df_filled = df.fillna('NEW VALUE!')
df_filled

,first_name,last_name,age,sex,pre_movie_score,post_movie_score
0,Tom,Hanks,63.00,m,8.00,10.00
1,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!
2,Hugh,Jackman,51.00,m,NEW VALUE!,NEW VALUE!
3,Oprah,Winfrey,66.00,f,6.00,8.00
4,Emma,Stone,31.00,f,7.00,9.00

In [48]:
df_filled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   first_name        5 non-null      object
 1   last_name         5 non-null      object
 2   age               5 non-null      object
 3   sex               5 non-null      object
 4   pre_movie_score   5 non-null      object
 5   post_movie_score  5 non-null      object
dtypes: object(6)
memory usage: 368.0+ bytes

In [54]:
type(df_filled['age'][0])
# Pandas fills in strigs in columns that should be numeric
# Allthough the rest of the values are still numeric
# in the overview the Dtype for the column in shown to be object (string)

float

In [55]:
type(df_filled['age'][1])

str

In [51]:
df_filled['age'].dtype

dtype('O')

In [56]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00    m             8.00             10.00
1        NaN       NaN   nan  NaN              nan               nan
2       Hugh   Jackman 51.00    m              nan               nan
3      Oprah   Winfrey 66.00    f             6.00              8.00
4       Emma     Stone 31.00    f             7.00              9.00

In [59]:
df['pre_movie_score'].fillna(0)

# this change is not permanent, a reassigment is neccesary (see below)

0   8.00
1   0.00
2   0.00
3   6.00
4   7.00
Name: pre_movie_score, dtype: float64

In [68]:
df['pre_movie_score'] = df['pre_movie_score'].fillna(0)
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00    m             8.00             10.00
1        NaN       NaN   nan  NaN             0.00               nan
2       Hugh   Jackman 51.00    m             0.00               nan
3      Oprah   Winfrey 66.00    f             6.00              8.00
4       Emma     Stone 31.00    f             7.00              9.00

In [80]:
df = pd.read_csv('./course-data/movie_scores.csv')

In [81]:
df['pre_movie_score'].mean()

7.0

In [82]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0   8.00
1   7.00
2   7.00
3   6.00
4   7.00
Name: pre_movie_score, dtype: float64

In [83]:
df.fillna(df.mean())

# quick and dirty way to fill in nan values for numeric columns
# note that filling in average values doesn't make sense for all columns (e.g. 'age')

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks 63.00    m             8.00             10.00
1        NaN       NaN 52.75  NaN             7.00              9.00
2       Hugh   Jackman 51.00    m             7.00              9.00
3      Oprah   Winfrey 66.00    f             6.00              8.00
4       Emma     Stone 31.00    f             7.00              9.00

In [102]:
airline_tix = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}

In [103]:
ser = pd.Series(airline_tix)
ser

# in this series it makes sense to interpolate the value of the business ticket
# here: a linear interpolation between 50 and 100

first          100.00
business          nan
economy-plus    50.00
economy         30.00
dtype: float64

In [104]:
ser.interpolate()

first          100.00
business        75.00
economy-plus    50.00
economy         30.00
dtype: float64

In [105]:
df = pd.DataFrame(ser,columns=['Price'])

# for some interpolation methods Pandas expects a DataFrame instead of a series

In [106]:
df

              Price
first        100.00
business        nan
economy-plus  50.00
economy       30.00

In [107]:
df.interpolate()

              Price
first        100.00
business      75.00
economy-plus  50.00
economy       30.00

In [108]:
df = df.reset_index()

In [109]:
df

          index  Price
0         first 100.00
1      business    nan
2  economy-plus  50.00
3       economy  30.00

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   4 non-null      object
 1   Price   3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 192.0+ bytes

In [117]:
df.interpolate()
# straigth line segnet between 50 and 100

          index  Price
0         first 100.00
1      business  75.00
2  economy-plus  50.00
3       economy  30.00

In [116]:
df.interpolate(method='spline',order=2)

          index  Price
0         first 100.00
1      business  73.33
2  economy-plus  50.00
3       economy  30.00